cavity/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 8.27e-4;

boundaryField
{
    inlet
    { 
	type            calculated; 
	value 		uniform 8.27e-4;
    }
    outlet   
    { 
	type            calculated; 
	value 		uniform 8.27e-4;
    }
    upperWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 8.27e-4;
    }
    lowerWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 8.27e-4;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
