cavity/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 287.4;

boundaryField
{
    inlet
    { 
	type            fixedValue; 
	value 		uniform 287.4;
    }
    outlet   
    { 
	type		zeroGradient; 
    }
    lowerWall
    {
        type            epsilonWallFunction;
        value           uniform 287.4;
    }

    upperWall
    {
        type            epsilonWallFunction;
        value           uniform 287.4;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
