cavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    inlet
    { 
	type           fixedValue; 
	value          uniform 1.5;
    }
    outlet   
    { 
	type           zeroGradient; 
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    upperWall
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
