cavity/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7e-4;

boundaryField
{
    inlet
    { 
	type           calculated; 
	value          uniform 7e-4;
    }
    outlet   
    { 
	type           calculated; 
	value          uniform 7e-4;
    }
    

    lowerWall
    {
        type            nutkWallFunction;
	Cmu             0.09 ;
	kappa           0.41;
	E               9.8;
        value           uniform  7e-4;
    }
    upperWall
    {
        type            nutkWallFunction;
	Cmu             0.09 ;
	kappa           0.41;
	E               9.8;
        value           uniform  7e-4;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
