cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       8820;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       8850;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       8880;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       9030;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9000;
        startFace       9180;
    }
)

// ************************************************************************* //
