cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0  0.0   0.0)
    (0.15 0.0   0.0)
    (0.15 0.015 0.0)
    (0.0  0.015 0.0)
    (0.0  0.0   0.001)
    (0.15 0.0   0.001)
    (0.15 0.015 0.001)
    (0.0  0.015 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
   inlet
    {
        type patch;
        faces ((0 4 7 3));
    }

    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }

    lowerWall
    {
        type wall;
        faces ((0 1 5 4));
    }

    upperWall
    {
        type wall;
        faces ((3 7 6 2));
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
	    (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
